# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'd12frosted/emacs-plus'
tap 'hashicorp/tap'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'cmake' # needed for vterm compilation
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'stripe/stripe-cli/stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'ripgrep'
brew 'findutils'
brew 'fd'
brew 'youtube-dl'

# # Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
#brew 'php'
#brew 'php@7.4'
#brew 'php@7.3'
#brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'meilisearch'
brew 'memcached'
#brew 'mysql'
#brew 'nginx'
#brew 'node'
#brew 'redis'
#brew 'yarn'

#brew 'emacs-plus@27'# --with-mailutils' # not working with apple silicon
brew  'emacs-plus --HEAD --with-modern-black-dragon-icon --with-mailutils'
brew 'terraform'
brew 'ansible'
brew 'binwalk'
brew 'ripgrep'
brew 'fd'
brew 'docker'
brew 'docker-compose'
brew 'magic-wormhole'
brew 'mailutils'
brew 'nmap'
brew 'sqlite'
#brew 'unrar'
brew 'hashicorp/tap/packer'

# Apps
# cask 'lastpass'
cask 'aerial'
cask 'caffeine'
# cask 'dbngin'
# cask 'discord'
cask 'docker'

cask 'firefox'
# cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
# cask 'gpg-suite'
cask 'imageoptim'
#cask 'signal'
#cask 'skype'
#cask 'slack'
#cask 'steam'
#cask 'sublime-text'
#cask 'tableplus'
#cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmission'
#cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
#cask 'zoom'

## My apps
# Quicklook
#cask 'qlmarkdown'
cask 'quicklook-json'
cask 'brave-browser'
cask 'iterm2'
#cask 'virtualbox'
cask 'evernote'
cask 'vagrant'
cask 'quicken'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-ubuntu-nerd-font'
#cask 'font-ubuntumono-nerd-font'
# cask 'font-spacemono-nerd-font'
#cask 'font-sourcecodepro-nerd-font'
#cask 'font-sourcecodepro-nerd-font-mono'
#cask 'font-hack-nerd-font'
#cask 'font-hack-nerd-font-mono'
cask 'font-iosevka-ss04'
cask 'font-iosevka-nerd-font'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
#mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
#mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
#mas 'Surfshark', id: 1437809329
mas 'Drafts', id: 1435957248
mas 'Magnet', id: 441258766 
mas 'Disk Cleaner', id: 970246631
mas 'Surfshark VPN', id: 1437809329
